[{"project":"git-started","img":"website-pics/git-started.png","imgtype":"fullscreen-screenshot","desc":"Our first assignment in INFO 343 (Client Side Web Development) was to create a single HTML page devoted to a fictional character.","url":"websites/git-started/git-started.html"},
{"project":"dawg-coffee","img":"website-pics/dawg-coffee.png","imgtype":"fullscreen-screenshot","desc":"Our second assignment was to replicate a design for fictional a cafe dubbed Dawg Coffee. Of particular note is the use of bootstrap.","url":"websites/dawg-coffee/dawg-coffee.html"},
{"project":"police-shootings","img":"website-pics/police-shootings.png","imgtype":"fullscreen-screenshot","desc":"I used leaflet.js in conjunction with a custom-made map from MapBox to create an interactive map that visualizes shootings by police across the United States. Data was sourced from Deadspin.","url":"websites/police-shooting/police-shooting.html"},
{"project":"crud-reviews","img":"website-pics/crud-reviews.png","imgtype":"fullscreen-screenshot","desc":"We were to create a CRUD (create, read, update, delete) application--a review page. Mine had ducks reviewing the University of Washington campus and warning visitors of vicious seagulls and loud geese. We used Parse to store data for this assignment.","url":"websites/crud-reviews/crud-reviews.html"},
{"project":"spotify-app","img":"website-pics/spotify.png","imgtype":"fullscreen-screenshot","desc":"We were assigned to use the Spotify API to create a web application. This was rather open-ended. I created a simple front-end for their search engine. It'd be nice to have it play full songs, rather than samples, but I suppose that's what Spotify is for.","url":"websites/spotify-app/spotify-app.html"},
{"project":"iSchool Application Portfolio","img":"website-pics/ischool.png","imgtype":"fullscreen-screenshot","desc":"I wrote this portfolio around June 2015 to accompany my application to the University of Washington's informatics undergraduate program.","url":"joelelizaga.com"}]